Core/src/InformationRegisters/СведенияРеглОтчетАлкоПрил12Раздел1/СведенияРеглОтчетАлкоПрил12Раздел1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияРеглОтчетАлкоПрил12Раздел1</name>
  <resources>
    <name>П000010000301</name>
    <comment>Вид продукции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000302</name>
    <comment>Код вида продукции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000303</name>
    <comment>Наименование производителя/импортера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000304</name>
    <comment>ИНН производителя/импортера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000305</name>
    <comment>КПП производителя/импортера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000306</name>
    <comment>Остаток на начало отчетного периода</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000307</name>
    <comment>Закупки от организаций-производителей</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000308</name>
    <comment>Закупки от организаций оптовой торговли</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000309</name>
    <comment>Закупки по импорту</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000310</name>
    <comment>Итого по закупкам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000311</name>
    <comment>Возврат от покупателя</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000312</name>
    <comment>Прочее поступление</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000313</name>
    <comment>Поступление всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000314</name>
    <comment>Расход объем розничной продажи</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000315</name>
    <comment>Расход прочий расход</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000316</name>
    <comment>Расход возврат поставщику</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000317</name>
    <comment>Расход всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000010000318</name>
    <comment>Остаток на конец отчетного периода всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХешИдПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешИдКодПродПроизв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортер</name>
    <type>
      <types>DefinedType.КонтрагентБРО</types>
    </type>
  </attributes>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РегламентированныйОтчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИндексСтраницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИндексСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДДокИндСтраницы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Catalogs/СтраныМира/СтраныМира.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтраныМира</name>
  <predefined>
    <items>
      <name>Россия</name>
      <description>РОССИЯ</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАльфа2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАльфа3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодРС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/InformationRegisters/СведенияРеглОтчетАлкоПрил12Раздел1/Forms/ФормаЗаписи/Module.bsl
#Область ОписаниеПеременных

&НаСервере
Перем ОбъектЭтогоОтчета; // Объект метаданных отчета, из которого открыта форма записи.

&НаКлиенте
Перем УправляемаяФормаВладелец; // Форма отчета, из которого открыта форма записи.

&НаКлиенте
Перем УникальностьФормы; // Уникальный идентификатор формы отчета.

&НаКлиенте
Перем ПоказыватьПредупреждениеПослеПереходаПоСсылке; // Флаг необходимости показа предупреждения.

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УправлениеВидимостью(Ложь);
	
	ЦветСтиляНезаполненныйРеквизит 	= ЦветаСтиля["ЦветНезаполненныйРеквизитБРО"];
	ЦветСтиляЦветГиперссылкиБРО		= ЦветаСтиля["ЦветГиперссылкиБРО"];
	ФормированиеПредставленияПродукцииНаСервере(Запись.П000010000301, Запись.П000010000302);
		
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЦветСтиляНезаполненныйРеквизит 	= ЦветаСтиля["ЦветНезаполненныйРеквизитБРО"];
	ЦветСтиляЦветГиперссылкиБРО		= ЦветаСтиля["ЦветГиперссылкиБРО"];
	
	// Определим текст запроса динамического списка.
	СтрокаРегистрСведенийСведенияОбАлкогольнойПродукции = "";
	РегламентированнаяОтчетностьПереопределяемый.СтрокаРегистрСведенийСведенияОбАлкогольнойПродукции(
														СтрокаРегистрСведенийСведенияОбАлкогольнойПродукции);
	СтрокаПеречислениеВидыЛицензийНаПродажуАлкоголяПиво = "";
	РегламентированнаяОтчетностьПереопределяемый.СтрокаПеречислениеВидыЛицензийНаПродажуАлкоголяПиво(
														СтрокаПеречислениеВидыЛицензийНаПродажуАлкоголяПиво);
			
	МетаданныеНоменклатуры = Метаданные.Справочники.Номенклатура;
	ЕстьПроизводитель = ОбщегоНазначения.ЕстьРеквизитОбъекта("Производитель", МетаданныеНоменклатуры);
	ЕстьИмпортер = ОбщегоНазначения.ЕстьРеквизитОбъекта("Импортер", МетаданныеНоменклатуры);
	
	МетаданныеКонтрагенты = Метаданные.Справочники.Контрагенты;
	ЕстьСтранаРегистрации = ОбщегоНазначения.ЕстьРеквизитОбъекта("СтранаРегистрации", МетаданныеКонтрагенты);
	ЕстьНалоговыйНомер = ОбщегоНазначения.ЕстьРеквизитОбъекта("НалоговыйНомер", МетаданныеКонтрагенты);
	
	ВставитьКодПродукции = Ложь;
	
	Если (НЕ ПустаяСтрока(СтрокаРегистрСведенийСведенияОбАлкогольнойПродукции)) 
	    И (НЕ ПустаяСтрока(СтрокаПеречислениеВидыЛицензийНаПродажуАлкоголяПиво))
		И ЕстьПроизводитель И ЕстьИмпортер И ЕстьНалоговыйНомер И ЕстьСтранаРегистрации Тогда
	
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|
				|	ПроизводителиИмпортеры.ПроизводительИмпортер.НаименованиеПолное КАК НаименованиеПолное,
				|	ВЫБОР
				|		КОГДА ПроизводителиИмпортеры.ПроизводительИмпортер.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
				|			ТОГДА ПроизводителиИмпортеры.ПроизводительИмпортер.ИНН
				|		ИНАЧЕ ПроизводителиИмпортеры.ПроизводительИмпортер.НалоговыйНомер
				|	КОНЕЦ КАК ИНН,
				|	ВЫБОР
				|		КОГДА ПроизводителиИмпортеры.ПроизводительИмпортер.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
				|			ТОГДА ПроизводителиИмпортеры.ПроизводительИмпортер.КПП
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК КПП,
				|	ПроизводителиИмпортеры.ПроизводительИмпортер.СтранаРегистрации КАК СтранаРегистрации
				|ИЗ
				|	(ВЫБРАТЬ
				|		ВЫБОР
				|			КОГДА СправочникНоменклатура.Импортер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				|				ТОГДА СправочникНоменклатура.Производитель
				|			ИНАЧЕ СправочникНоменклатура.Импортер
				|		КОНЕЦ КАК ПроизводительИмпортер
				|	ИЗ
				|		" + СтрокаРегистрСведенийСведенияОбАлкогольнойПродукции + " КАК СведенияОбАлкогольнойПродукции
				|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
				|			ПО СведенияОбАлкогольнойПродукции.Номенклатура = СправочникНоменклатура.Ссылка
				|	ГДЕ
				|		СведенияОбАлкогольнойПродукции.ВидЛицензии = ЗНАЧЕНИЕ(" 
				+ СтрокаПеречислениеВидыЛицензийНаПродажуАлкоголяПиво + ")
				|		И СведенияОбАлкогольнойПродукции.КодВида169 = &КодПродукции) КАК ПроизводителиИмпортеры
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
				|		ПО ПроизводителиИмпортеры.ПроизводительИмпортер = Контрагенты.Ссылка";
				
		ВставитьКодПродукции = Истина;
		
	ИначеЕсли ЕстьПроизводитель И ЕстьИмпортер И ЕстьНалоговыйНомер И ЕстьСтранаРегистрации Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|
				|	ВЫРАЗИТЬ(ПроизводителиИмпортеры.ПроизводительИмпортер.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
				|	ПроизводителиИмпортеры.ПроизводительИмпортер.ИНН КАК ИНН,
				|	ВЫБОР
				|		КОГДА ПроизводителиИмпортеры.ПроизводительИмпортер.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
				|			ТОГДА ПроизводителиИмпортеры.ПроизводительИмпортер.КПП
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК КПП,
				|	ПроизводителиИмпортеры.ПроизводительИмпортер.СтранаРегистрации КАК СтранаРегистрации
				|ИЗ
				|	(ВЫБРАТЬ
				|		СправочникНоменклатура.ПроизводительИмпортерАлкогольнойПродукции КАК ПроизводительИмпортер
				|	ИЗ
				|		Справочник.Номенклатура КАК СправочникНоменклатура) КАК ПроизводителиИмпортеры
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
				|		ПО ПроизводителиИмпортеры.ПроизводительИмпортер = Контрагенты.Ссылка";
		
	ИначеЕсли ЕстьНалоговыйНомер И ЕстьСтранаРегистрации Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|
				|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
				|	Контрагенты.ИНН  КАК ИНН,
				|	ВЫБОР
				|		КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
				|			ТОГДА Контрагенты.КПП
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК КПП,
				|	Контрагенты.СтранаРегистрации КАК СтранаРегистрации				
				|ИЗ
				|Справочник.Контрагенты КАК Контрагенты
				|ГДЕ Контрагенты.НаименованиеПолное ЕСТЬ НЕ NULL";
				
	Иначе
				
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|
				|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
				|	Контрагенты.ИНН КАК ИНН,
				|	Контрагенты.КПП КАК КПП,
				|	"""" КАК СтранаРегистрации				
				|ИЗ
				|Справочник.Контрагенты КАК Контрагенты
				|ГДЕ Контрагенты.НаименованиеПолное ЕСТЬ НЕ NULL";
				
	КонецЕсли;
	    
	ДинСписокПроизводителяИмпортера.ТекстЗапроса = ТекстЗапроса;
	ДинСписокПроизводителяИмпортера.ОсновнаяТаблица = "Справочник.Контрагенты";
	ДинСписокПроизводителяИмпортера.ДинамическоеСчитываниеДанных = Истина;
	
	Элементы.ТаблицаПроизводителей.Обновить();
		
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Ищем управляемую форму, откуда открыли.
	Если ВладелецФормы = Неопределено Тогда
	    Отказ = Истина;
		ТекстПредупреждения = НСтр("ru='Данная форма вспомогательная, предназначена для редактирования данных"
"из форм регламентированных отчетов!';ka='Данная форма вспомогательная, предназначена для редактирования данных"
"из форм регламентированных отчетов!'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;	
	КонецЕсли;
	
	ТекущийРодитель = ВладелецФормы;
	 
	Пока ТипЗнч(ТекущийРодитель) <> Тип("УправляемаяФорма") Цикл
	    ТекущийРодитель = ТекущийРодитель.Родитель;		
	КонецЦикла; 
			
	УправляемаяФормаВладелец		= ТекущийРодитель;
	ИмяФормыВладельца 	= УправляемаяФормаВладелец.ИмяФормы;
	
	УникальностьФормы   = УправляемаяФормаВладелец.УникальностьФормы;
	Оповестить("ОткрытаФормаЗаписиРегистра", ЭтаФорма, УникальностьФормы);
		
	ТекущееСостояниеВладельца = УправляемаяФормаВладелец.ТекущееСостояние;
	
    ДокументЗаписи = 		УправляемаяФормаВладелец.СтруктураРеквизитовФормы.мСохраненныйДок;
	ИндексСтраницыЗаписи = 	УправляемаяФормаВладелец.ИндексАктивнойСтраницыВРегистре;
	ИндексСтраницы = 		УправляемаяФормаВладелец.НомерАктивнойСтраницыМногострочногоРаздела;
	НомерПоследнейЗаписи = 	УправляемаяФормаВладелец.КоличествоСтрок;
	МаксИндексСтраницы = 	УправляемаяФормаВладелец.МаксИндексСтраницы;
	
	ПоказыватьПредупреждениеПослеПереходаПоссылке = УправляемаяФормаВладелец.ПоказыватьПредупреждениеПослеПереходаПоссылке;
	
	Если ТекущееСостояниеВладельца = "Добавление" или ТекущееСостояниеВладельца = "Копирование" Тогда
				
		// Заполним измерения, их нет на форме.
	    Запись.Активно = Истина;
		
		Запись.Документ = ДокументЗаписи;
		Запись.ИндексСтраницы = ИндексСтраницыЗаписи;
		НомерПоследнейЗаписи = НомерПоследнейЗаписи + 1;
	    Запись.ИндексСтроки = НомерПоследнейЗаписи;
		
		Модифицированность = Истина;
		
	КонецЕсли;
		
	Заголовок = "Движение слабоалкогольной продукции";
	
	ФлажокОтклАвтоРасчет 	= УправляемаяФормаВладелец.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет;
	ФлажокОтклАвтоВыборКодов	= УправляемаяФормаВладелец.СтруктураРеквизитовФормы.мАвтоВыборКодов;
	ДатаПериодаОтчета = УправляемаяФормаВладелец.СтруктураРеквизитовФормы.мДатаКонцапериодаОтчета;
	
	ПодготовкаНаСервере();

	Если НЕ ВладелецФормы.ТекущийЭлемент = Неопределено Тогда
		
		ИмяАктивногоПоля = ВладелецФормы.ТекущийЭлемент.Имя;
		
		// Если активное поле Наименование продукции - перекинем на код.
		Если ИмяАктивногоПоля = "П000010000301" Тогда
		    ИмяАктивногоПоля = "П000010000302";			
		КонецЕсли; 
		
	    АктивноеПоле = Элементы.Найти(ИмяАктивногоПоля);
		Если НЕ АктивноеПоле = Неопределено Тогда
		    ТекущийЭлемент = АктивноеПоле;		
		КонецЕсли;
	
	КонецЕсли;
			
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("ЗакрытаФормаЗаписиРегистра", , УникальностьФормы);
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
				
	ВнесеныИзменения = Модифицированность;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтоПервоеРедактирование = Ложь;
	
	Если ТекущееСостояниеВладельца = "Добавление" или ТекущееСостояниеВладельца = "Копирование" Тогда
		
		РегламентированнаяОтчетностьАЛКО.ДобавитьВРегистрЖурнала(ТекущийОбъект.Документ, ИмяРегистра,
									ТекущийОбъект.ИндексСтраницы, ТекущийОбъект.ИндексСтроки, "ДобавлениеСтроки");
									
	ИначеЕсли ВнесеныИзменения Тогда
		
		// Нужно записать первоначальные данные Записи регистра в журнал.
		// Но сделать это надо только для случая первого изменения Записи после последнего сохранения отчета,
		// чтобы была информация о данных до изменения в случае отката внесенных изменений, если
		// отказался пользователь от сохранения отчета.
		
		ЭтоПервоеРедактирование = РегламентированнаяОтчетностьАЛКО.ЭтоПервоеРедактированиеЗаписиРегистра(ТекущийОбъект.Документ, ИмяРегистра, 
															ТекущийОбъект.ИндексСтраницы, ТекущийОбъект.ИндексСтроки);
				
	КонецЕсли;
	
	Если ЭтоПервоеРедактирование Тогда
		
		Ресурсы = Новый Структура;
		Ресурсы.Вставить("НачальноеЗначение", НачальноеЗначение);
		Ресурсы.Вставить("КоличествоСтрок", НомерПоследнейЗаписи);
		Ресурсы.Вставить("МаксИндексСтраницы", МаксИндексСтраницы);
		
		// Нужно сохранить первоначальные данные.
		РегламентированнаяОтчетностьАЛКО.ДобавитьВРегистрЖурнала(ТекущийОбъект.Документ, ИмяРегистра,
									ТекущийОбъект.ИндексСтраницы, ТекущийОбъект.ИндексСтроки, "Редактирование", Ресурсы);
	Иначе
									
		Ресурсы = Новый Структура;
		Ресурсы.Вставить("КоличествоСтрок", НомерПоследнейЗаписи);		
		Ресурсы.Вставить("МаксИндексСтраницы", МаксИндексСтраницы);
		
		РегламентированнаяОтчетностьАЛКО.ДобавитьВРегистрЖурнала(ТекущийОбъект.Документ, ИмяРегистра,
									ТекущийОбъект.ИндексСтраницы, 0, "Сервис", Ресурсы);							
	КонецЕсли;
	
	Если ВнесеныИзменения Тогда
		РегламентированнаяОтчетностьАЛКО.ПолучитьВнутреннееПредставлениеСтруктурыДанныхЗаписи(
											Запись, ИмяРегистра, КонечноеЗначениеСтруктураДанных);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	// Оповещаем о необходимости пересчета итогов форму-владелец для активных записей.
	Если ВнесеныИзменения и Запись.Активно Тогда
	 
		// Оповещаем форму-владелец о изменениях.
		ИнформацияДляПересчетаИтогов = Новый Структура;
		ИнформацияДляПересчетаИтогов.Вставить("ИмяРегистра", 		ИмяРегистра);
		ИнформацияДляПересчетаИтогов.Вставить("ИндексСтраницы", 	ИндексСтраницы);
		ИнформацияДляПересчетаИтогов.Вставить("ИндексСтроки", 		Запись.ИндексСтроки);
		ИнформацияДляПересчетаИтогов.Вставить("НачальноеЗначение", 	НачальноеЗначениеСтруктураДанных);
		ИнформацияДляПересчетаИтогов.Вставить("КонечноеЗначение", 	КонечноеЗначениеСтруктураДанных);
		
		Оповестить("ПересчетИтогов", ИнформацияДляПересчетаИтогов, УникальностьФормы);
	
	КонецЕсли;
	
	ВнесеныИзменения = Ложь;
		
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если (НЕ ЗавершениеРаботы = Неопределено) и ЗавершениеРаботы Тогда
		// Идет завершение работы системы.
	Иначе
		// Обычное закрытие.
	    Если Элементы.ГруппаВыборПроизводителя.Видимость Тогда
		    // Щелкнули на крестик при выборе производителя.
			Отказ = Истина;
		    УправлениеВидимостью(Ложь);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = УникальностьФормы Тогда
		
		Если НРег(ИмяСобытия) = НРег("ЗакрытьОткрытыеФормыЗаписи") Тогда			
		    Модифицированность = Ложь;
			Закрыть();			
		КонецЕсли;
					
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборВидаПродукции();
	
КонецПроцедуры


&НаКлиенте
Процедура П000010000301Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборВидаПродукции();
	
КонецПроцедуры


&НаКлиенте
Процедура П000010000302Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборВидаПродукции();
	
КонецПроцедуры


&НаКлиенте
Процедура П000010000304ПриИзменении(Элемент)
	
	ОбработкаПослеИзменения();
	
КонецПроцедуры


&НаКлиенте
Процедура П000010000305ПриИзменении(Элемент)
	
	ОбработкаПослеИзменения();
	
КонецПроцедуры


&НаКлиенте
Процедура П000010000303ПриИзменении(Элемент)
	
	ОбработкаПослеИзменения();
	
КонецПроцедуры


&НаКлиенте
Процедура ПроизводительИмпортерПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	НажатиеГиперссылки(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПроизводителей

&НаКлиенте
Процедура ТаблицаПроизводителейВыбор(Элемент, ВыбраннаяСтрока = Неопределено, Поле = Неопределено, СтандартнаяОбработка = Истина)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
	    Возврат;	
	КонецЕсли; 
	
	Производитель 		= Элемент.ТекущиеДанные.НаименованиеПолное;
	
	ПроизводительИНН	= Элемент.ТекущиеДанные.ИНН;
	ПроизводительКПП	= Элемент.ТекущиеДанные.КПП;	
	
	ТаблицаПроизводителейВыборНаСервере(Производитель, ПроизводительИНН, ПроизводительКПП);
			
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаПроизводителейПриАктивизацииСтроки(Элемент)
	
	Если НЕ ПроверялиНеобходимостьПоказаПредупреждения Тогда	
		
		Элементы.ГруппаИнфоВыбораПроизводителя.Видимость = (Элемент.ТекущиеДанные = Неопределено);			
		
		ПроверялиНеобходимостьПоказаПредупреждения = Истина;
		
	КонецЕсли;	 
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьИЗакрыть(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если НЕ Модифицированность Тогда
	    Закрыть();
	Иначе	
	    Записать();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьПроизводителяИмпортера(Команда)
	
	УправлениеВидимостью(Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыборПроизводителя(Команда)
	
	ТаблицаПроизводителейВыбор(Элементы.ТаблицаПроизводителей);
	
КонецПроцедуры


&НаКлиенте
Процедура ВернутьсяНазад(Команда)
	
	УправлениеВидимостью(Ложь);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовкаНаСервере()
	
	Если ТекущееСостояниеВладельца = "Добавление" или ТекущееСостояниеВладельца = "Копирование" Тогда
		Запись.ИДДокИндСтраницы = РегламентированнаяОтчетностьАЛКО.ПолучитьИдДокИндСтраницы(Запись.Документ, Запись.ИндексСтраницы);
	КонецЕсли;
	
	УправлениеВидимостью(Ложь);
	
	ДоступностьПолейНаСервере();	
	СформироватьСпискиВыбораНаСервере();
	ФормированиеПредставленияПродукцииНаСервере(Запись.П000010000301, Запись.П000010000302);
		
	// Заполним начальное значение всех полей записи во внутреннем формате.
	ИмяРегистра = РегламентированнаяОтчетностьАЛКО.ПолучитьИмяОбъектаМетаданныхПоИмениФормы(ИмяФормы);
	
	Если ТекущееСостояниеВладельца = "Добавление" или ТекущееСостояниеВладельца = "Копирование" Тогда
		
		// Начальные данные в этих случаях всегда пустые.
		НачальноеЗначениеСтруктураДанных = РегламентированнаяОтчетностьАЛКО.ПолучитьСтруктуруДанныхЗаписиРегистраСведений(ИмяРегистра);
		НачальноеЗначение = ЗначениеВСтрокуВнутр(НачальноеЗначениеСтруктураДанных);
		
	Иначе
		НачальноеЗначение = РегламентированнаяОтчетностьАЛКО.ПолучитьВнутреннееПредставлениеСтруктурыДанныхЗаписи(
															Запись, ИмяРегистра, НачальноеЗначениеСтруктураДанных);
	КонецЕсли;	
	
	
КонецПроцедуры


&НаСервере
Процедура ДоступностьПолейНаСервере()
	
	// Доступность полей формы в зависимости от флажка Авторасчет в отчете-владельце.
	Элементы.П000010000310.ТолькоПросмотр = НЕ ФлажокОтклАвтоРасчет;
	Элементы.П000010000313.ТолькоПросмотр = НЕ ФлажокОтклАвтоРасчет;
	Элементы.П000010000317.ТолькоПросмотр = НЕ ФлажокОтклАвтоРасчет;
	Элементы.П000010000318.ТолькоПросмотр = НЕ ФлажокОтклАвтоРасчет;
	
	Элементы.П000010000310.ПропускатьПриВводе = НЕ ФлажокОтклАвтоРасчет;
	Элементы.П000010000313.ПропускатьПриВводе = НЕ ФлажокОтклАвтоРасчет;
	Элементы.П000010000317.ПропускатьПриВводе = НЕ ФлажокОтклАвтоРасчет;
	Элементы.П000010000318.ПропускатьПриВводе = НЕ ФлажокОтклАвтоРасчет;
	
КонецПроцедуры


&НаСервере
Функция ОбъектОтчета(ИмяФормыОбъекта)
	
	Возврат РегламентированнаяОтчетностьАЛКО.ОбъектОтчетаАЛКО(ИмяФормыОбъекта, ОбъектЭтогоОтчета);
	
КонецФункции


&НаСервере
Процедура ОбработкаМодифицированности(НачальноеЗначениеПолей, СтруктураМодифицированности)
	
	МодифицированностьКлючевыхПолей = Ложь;
	Для Каждого ЭлСтруктуры Из СтруктураМодифицированности Цикл
	
		ИмяПоля = ЭлСтруктуры.Ключ;
		Если Лев(ИмяПоля, 2) <> "П0" Тогда
		    // Это не ресурс.
			Продолжить;			
		КонецЕсли;
					
		Если ЭлСтруктуры.Значение Тогда
		    МодифицированностьКлючевыхПолей = Истина;
			Прервать;			
		КонецЕсли; 
	
	КонецЦикла;
	
	Если НЕ МодифицированностьКлючевыхПолей Тогда
		
		// Принудительно записываем начальные данные, включая всю
		// вспомогательную информацию.
		ЗаполнитьЗначенияСвойств(Запись, НачальноеЗначениеПолей);
		
	Иначе
		
		// Анализ изменений Производителя.
		ИНН = СокрЛП(Запись.П000010000304);
		КПП = СокрЛП(Запись.П000010000305);
		НаименованиеПолное = СокрЛП(Запись.П000010000303);
		КодПродукции = Запись.П000010000302;
		
		Запись.ПроизводительИмпортер = ОбъектОтчета(ИмяФормыВладельца).ОпределитьПроизводителяИмпортера(
																ИНН, КПП, НаименованиеПолное, КодПродукции);
	КонецЕсли;
		
	Модифицированность = МодифицированностьКлючевыхПолей;
	
КонецПроцедуры


&НаСервере
Процедура ОбработкаПослеИзменения()
	
	ОбъектОтчета(ИмяФормыВладельца).ОбработкаЗаписи(ИмяРегистра, Запись);
	
	СтруктураМодифицированности = "";
	РегламентированнаяОтчетностьАЛКО.ЗаписьИзменилась(Запись, НачальноеЗначениеСтруктураДанных, 
														Ложь, СтруктураМодифицированности);
	ОбработкаМодифицированности(НачальноеЗначениеСтруктураДанных, СтруктураМодифицированности);
	
	ФормированиеЗаголовковСвернутогоОтображения();
	
КонецПроцедуры


&НаСервере
Процедура ФормированиеЗаголовковСвернутогоОтображения()
		
	// Группа ПроизводительИмпортер.
	Элементы.ПроизводительИмпортерПредставление.Видимость = (НЕ Запись.ПроизводительИмпортер = Неопределено);
	
	Если ЗначениеЗаполнено(Запись.П000010000303) 
		или ЗначениеЗаполнено(Запись.П000010000304)
		или ЗначениеЗаполнено(Запись.П000010000305)
		Тогда
	    Элементы.ГруппаПроизводительИмпортер.ЗаголовокСвернутогоОтображения = "Производитель или импортер: " + 
			?(ЗначениеЗаполнено(Запись.П000010000303),Запись.П000010000303, "наименование не заполнено") 
			+ ?(ЗначениеЗаполнено(Запись.П000010000304),", ИНН " + Запись.П000010000304, ", ИНН не заполнено")
			+ ?(ЗначениеЗаполнено(Запись.П000010000305),", КПП " + Запись.П000010000305, 
											?(СтрДлина(Запись.П000010000304) = 10,", КПП не заполнено", "") );
	Иначе	
	    Элементы.ГруппаПроизводительИмпортер.ЗаголовокСвернутогоОтображения = 
							Элементы.ГруппаПроизводительИмпортер.Заголовок + " не заполнены!";							
	КонецЕсли;
						
	// Доступ к КПП только если введен 10 значный ИНН.
	Если СтрДлина(Запись.П000010000304) = 10 Тогда
	    Элементы.П000010000305.ТолькоПросмотр = Ложь;
		Элементы.П000010000305.ПропускатьПриВводе = Ложь;
	Иначе
		
	    Элементы.П000010000305.ТолькоПросмотр = Истина;
		Элементы.П000010000305.ПропускатьПриВводе = Истина;
		Если НЕ Запись.П000010000305 = "" Тогда
		    Запись.П000010000305 = "";
			Модифицированность = Истина;		
		КонецЕсли; 
		
	КонецЕсли; 
		
	// Остатки.
	Элементы.Остатки.ЗаголовокСвернутогоОтображения = "Остатки: на начало периода " 
					+ Формат(Запись.П000010000306, "ЧЦ = 15; ЧДЦ = 5; ЧН=; ЧВН;") + " | " 
					+ "на конец периода " + Формат(Запись.П000010000318, "ЧЦ = 15; ЧДЦ = 5; ЧН=; ЧВН;");
	
	// Поступление.
	Элементы.Поступление.ЗаголовокСвернутогоОтображения = "Поступление: всего " 
					+ Формат(Запись.П000010000313, "ЧЦ = 15; ЧДЦ = 5; ЧН=; ЧВН;") + " включая  закупки " 
					+ Формат(Запись.П000010000310, "ЧЦ = 15; ЧДЦ = 5; ЧН=; ЧВН;");
	
	// Расход.
	Элементы.Расход.ЗаголовокСвернутогоОтображения = "Расход: всего " 
					+ Формат(Запись.П000010000317, "ЧЦ = 15; ЧДЦ = 5; ЧН=; ЧВН;") + " включая  розничную продажу " 
					+ Формат(Запись.П000010000314, "ЧЦ = 15; ЧДЦ = 5; ЧН=; ЧВН;");
	
КонецПроцедуры


&НаСервере
Процедура ФормированиеПредставленияПродукцииНаСервере(ВидПродукции = Неопределено, КодВида = Неопределено)
	
	Если ВидПродукции = Неопределено Тогда
	    ВидПродукции = Запись.П000010000301;	
	КонецЕсли; 
	Если КодВида = Неопределено Тогда
	    КодВида = Запись.П000010000302;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодВида) Тогда
	    ПредставлениеПродукции = "Код " + КодВида + ", " + ВидПродукции;
	Иначе	
	    ПредставлениеПродукции = "Заполнить";
	КонецЕсли; 
	
	Если ПредставлениеПродукции = "Заполнить" Тогда		
		Элементы.Представление.ЦветТекста = ЦветСтиляНезаполненныйРеквизит;
	Иначе
		Элементы.Представление.ЦветТекста = ЦветСтиляЦветГиперссылкиБРО;
	КонецЕсли;
		
	ФормированиеЗаголовковСвернутогоОтображения();
		
КонецПроцедуры


&НаКлиенте
Процедура ВыборВидаПродукции()
		
	ИсходноеЗначение = СокрЛП(Запись.П000010000302);
	ИсходноеЗначениеНазвания = СокрЛП(Запись.П000010000301);
	КолонкаПоиска = "Код";
	ИмяКолонкиКодПродукции = "П000010000302";
	ИмяКолонкиНаименованияПродукции = "П000010000301";
	
	Если НЕ ФлажокОтклАвтоВыборКодов Тогда
	
		ПараметрВводаПоля = СвойстваПоказателей.НайтиСтроки(Новый Структура("Показатель", ИмяКолонкиКодПродукции));
		Если ПараметрВводаПоля.Количество() = 0 Тогда
			
			ПараметрВводаПоля = Неопределено;
			
			Для Каждого Стр из СвойстваПоказателей Цикл
				Если Лев(ИмяКолонкиКодПродукции, СтрДлина(Стр.Показатель)) = Стр.Показатель Тогда
					ПараметрВводаПоля = Стр;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			ПараметрВводаПоля = ПараметрВводаПоля[0];
		КонецЕсли;
		
		Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений.Количество() > 0 Тогда
			ТекстВыбора   = ПараметрВводаПоля.ТекстПриВыборе;
			ТаблицаВыбора = ПараметрВводаПоля.ТаблицаЗначений;
		Иначе
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок",          ТекстВыбора);
		ПараметрыФормы.Вставить("ТаблицаЗначений",    ТаблицаВыбора);
		ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура(КолонкаПоиска, ИсходноеЗначение));
		
		ДополнительныеПараметры = Новый Структура(" ИмяКолонкиНаименованияПродукции, ИмяКолонкиКодПродукции, ИсходноеЗначение",
												 ИмяКолонкиНаименованияПродукции, ИмяКолонкиКодПродукции, ИсходноеЗначение);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
				
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗаголовокФормы",          		"Ввод вида продукции");
		ПараметрыФормы.Вставить("Код",          				ИсходноеЗначение);
		ПараметрыФормы.Вставить("Название",          			ИсходноеЗначениеНазвания);
		ПараметрыФормы.Вставить("ИмяПоляЗначение",          	"Вид продукции");
		ПараметрыФормы.Вставить("ИмяПоляКод",          			"Код");
		ПараметрыФормы.Вставить("МногострочныйРежимЗначения",	Истина);
		ПараметрыФормы.Вставить("ДлинаПоляКода",          		4);
		ПараметрыФормы.Вставить("ДлинаПоляЗначения",       		40);
		ПараметрыФормы.Вставить("УникальностьФормы",       		УникальностьФормы);
		
		ДополнительныеПараметры = Новый Структура("ИсходноеЗначение, ИмяКолонкиКодПродукции, ИмяКолонкиНаименованияПродукции", 
									ИсходноеЗначение, ИмяКолонкиКодПродукции, ИмяКолонкиНаименованияПродукции);

		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("ОбщаяФорма.АЛКОФормаВводаПарыСвязанныхЗначений", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ВыборЗавершение(РезультатВыбора, Параметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
	    Возврат;	
	КонецЕсли; 
	
	// Поскольку всегда "выбираем" код.
	ИсходноеЗначение 				 = Параметры.ИсходноеЗначение;
	ИмяКолонкиНаименованияПродукции  = Параметры.ИмяКолонкиНаименованияПродукции;
	ИмяКолонкиКодПродукции           = Параметры.ИмяКолонкиКодПродукции;
		
	КодИзменился = (СокрЛП(ИсходноеЗначение) <> СокрЛП(РезультатВыбора.Код));
	
	// Присваиваем на случай смены режима выбора из списка,
	// если вручную были изменения не соответствующие списку выбора,
	// то после включения выбора из списка - вернем соответствие при выборе
	// даже того же кода.
	Запись[ИмяКолонкиКодПродукции] = СокрЛП(РезультатВыбора.Код);
	
	ИсходноеЗначениеНаименования = Строка(Запись[ИмяКолонкиНаименованияПродукции]);
	Запись[ИмяКолонкиНаименованияПродукции] = ?(СокрЛП(РезультатВыбора.Код) = "",
																"", СокрЛП(РезультатВыбора.Название)); 
	НаименованиеИзменилось = (СокрЛП(ИсходноеЗначениеНаименования) <> СокрЛП(Запись[ИмяКолонкиНаименованияПродукции]));	
		
	Модифицированность = Модифицированность или КодИзменился или НаименованиеИзменилось;
	
	ФормированиеПредставленияПродукцииНаСервере();
	ОбработкаПослеИзменения();
	
КонецПроцедуры


&НаСервере
Процедура Расчет()

	Если ФлажокОтклАвтоРасчет Тогда
	    Возврат;	
	КонецЕсли; 
	
	ИдГруппы = "П0000100003";
		
	ОбъектОтчета(ИмяФормыВладельца).Расчет(ИдГруппы, Запись);
	ФормированиеЗаголовковСвернутогоОтображения();
	
КонецПроцедуры


&НаСервере
Процедура СформироватьСпискиВыбораНаСервере()
		
	Если ДатаПериодаОтчета < '20131101' Тогда
		ИмяМакета = "Списки2012Кв3";
	ИначеЕсли ДатаПериодаОтчета < '20140901' Тогда
		ИмяМакета = "Списки2012Кв3_20131101";
	Иначе
		// С 3-го квартала 2015 года действует новый список.
		// Отчет квартальный, поэтому можно указать 01.09 как границу
		ИмяМакета = ?(ДатаПериодаОтчета < '20150901', "Списки2014Кв4", "Списки2015Кв3");		
	КонецЕсли;
	
	КоллекцияСписковВыбора = РегламентированнаяОтчетностьАЛКО.СчитатьКоллекциюСписковВыбораАЛКО(
														ИмяМакета, ИмяФормыВладельца, ОбъектЭтогоОтчета);
	
	СвойстваПоказателей.Очистить();
		
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000010000301", 3, , "Выбор вида продукции", КоллекцияСписковВыбора["ВидыПродукции"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000010000302", 3, , "Выбор вида продукции", КоллекцияСписковВыбора["ВидыПродукции"]);

КонецПроцедуры


&НаКлиенте
Процедура ПолеПриИзменении(Элемент)
	
	Расчет();
	ОбработкаПослеИзменения();
	
КонецПроцедуры


&НаСервере
Процедура УправлениеВидимостью(ПоказатьВыбор = Ложь)
	
	Если ПоказатьВыбор Тогда
		
		ПроверялиНеобходимостьПоказаПредупреждения = Ложь;
		
		Если ВставитьКодПродукции Тогда
			ДинСписокПроизводителяИмпортера.Параметры.УстановитьЗначениеПараметра("КодПродукции", Запись.П000010000302);
		КонецЕсли;
		
		Элементы.ОК.Видимость = Ложь;
		Элементы.Отмена.Видимость = Ложь;
		Элементы.ГруппаЗапись.Видимость = Ложь;
		Элементы.ГруппаВыборПроизводителя.Видимость = Истина;
		
		Если НЕ Запись.ПроизводительИмпортер = Неопределено Тогда
		
			Элементы.ТаблицаПроизводителей.ТекущаяСтрока = Запись.ПроизводительИмпортер;
		
		КонецЕсли;
		
	Иначе
		
		Элементы.ГруппаИнфоВыбораПроизводителя.Видимость = Ложь;
		
		Элементы.ГруппаВыборПроизводителя.Видимость = Ложь;
		Элементы.ГруппаЗапись.Видимость = Истина;	
		Элементы.Отмена.Видимость = Истина;
		Элементы.ОК.Видимость = Истина;	
		
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Функция ПолучитьИмяФормыОбъектаЭлементаСсылки(ИмяЭлементаСсылки, ЗначениеСсылка = Неопределено)
	
	ЗначениеСсылка = РегламентированнаяОтчетностьАЛКО.ПолучитьЗначениеЭлементаФормы(ЭтаФорма, ИмяЭлементаСсылки);	
	ИмяФормыОбъекта = РегламентированнаяОтчетностьАЛКО.ПолучитьИмяФормыОбъекта(ЗначениеСсылка);
	
	Возврат ИмяФормыОбъекта;
	
КонецФункции


&НаКлиенте
Процедура НажатиеГиперссылки(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ИмяЭлементаСсылки = Элемент.Имя;
	
	ЗначениеСсылка = Неопределено;
	ИмяФормыОбъекта = ПолучитьИмяФормыОбъектаЭлементаСсылки(ИмяЭлементаСсылки, ЗначениеСсылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НажатиеГиперссылкиЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ЗначениеСсылка);
	ОткрытьФорму(ИмяФормыОбъекта, ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура НажатиеГиперссылкиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ПоказыватьПредупреждениеПослеПереходаПоссылке = Неопределено Тогда
	    ПоказыватьПредупреждениеПослеПереходаПоссылке = Истина;	
	КонецЕсли;
	
	Если ПоказыватьПредупреждениеПослеПереходаПоссылке Тогда
	    // Открываем форму предупреждения.
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", НСтр("ka='ყურადღება!';ru='Внимание!'"));
		ПараметрыФормы.Вставить("ТекстПредупреждения", НСтр("ru='"
				+ "Если Вы внесли изменения в элемент справочника или документ,"
				+ " для внесения изменений в строки отчета, заполняемых на основании"
				+ " измененной информации, необходимо перезаполнить Отчет.
				|
				|Для этого в основной форме отчета нужно нажать кнопку ""Заполнить"".
				|
				|Не обязательно это делать прямо сейчас, это можно сделать после внесения"
				+ " всех необходимых правок по разным документам и справочникам.'"));
		ПараметрыФормы.Вставить("ТекстЗаголовкаФлажка", НСтр("ka='Больше не показывать в этом сеансе редактирования';ru='Больше не показывать в этом сеансе редактирования'"));
		ПараметрыФормы.Вставить("УникальностьФормы",       		УникальностьФормы);
		
		ИмяФормыПредупреждения = "ОбщаяФорма.АЛКОФормаПредупрежденияСФлажком";
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьСостояниеФлажкаФормыПредупреждения", ЭтотОбъект);
		ОткрытьФорму(ИмяФормыПредупреждения, ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьСостояниеФлажкаФормыПредупреждения(Результат, ДопПараметры) Экспорт
	
	Если (НЕ Результат = Неопределено) и Результат Тогда
		// Оповещаем форму отчета владельца о том, что больше показывать
		// предупреждение не надо.
		ПоказыватьПредупреждениеПослеПереходаПоссылке = Ложь;
		Оповестить("ПоказыватьПредупреждениеПослеПереходаПоСсылке", , УникальностьФормы);		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ТаблицаПроизводителейВыборНаСервере(Производитель, ПроизводительИНН, ПроизводительКПП)
		
	Запись.П000010000304 = СокрЛП(ПроизводительИНН);
	Запись.П000010000305 = СокрЛП(ПроизводительКПП);
	Запись.П000010000303 = СокрЛП(Производитель);
	
	УправлениеВидимостью(Ложь);
	
	ОбработкаПослеИзменения();
	
КонецПроцедуры

#КонецОбласти
